Tekla Open API Reference for Tekla Structures 2025
WpfShapeCatalog Properties
The WpfShapeCatalog type exposes the following members.
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedShape
 Gets or sets the selected Shape in the control.
Top
See Also
Reference
WpfShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace